import React from 'react'


export default function Home() {


    return (
        <div className="home mt-5">
            <div className='wrapper-max'>
                <p>
                    <h3>1 - وب سایت دارای 3 روت می باشد که در هدر نمایش داده شده است</h3>
                    <h4>-- محصولات(products)(Functional Components)</h4>
                    <h4>-- کاربران(users)(Class Components)</h4>
                    <h4>-- اعتبار سنجی(vertification)(Functional Components)</h4>
                    <br /><br />


                    <h3>2 - در روت اعتبار سنجی</h3>
                    <h4>-- فوکوس بر روی اینپوت اول</h4>
                    <h4>-- اینپوت ها فقط عدد دریافت می کنند</h4>
                    <h4>-- با تکمیل شدن هر اینپوت بر روی بعدی فوکوس می شود</h4>
                    <h4>-- وهمچنین با خالی کردن هر اینپوت بر روی قبلی فوکوس می شود</h4>
                    <h4>-- کلیک های حذف و تایید کد</h4>
                    <br /><br />


                    <h3>3 - در تمام پروژه با استفاده ار کلید های ترکیبی ctrl+shift+f2 مودال نمایش  داده می شود
                        و با استفاده از کلید های ترکیبی ctrl+shift+f2 بر روی تکس باکس فوکوس می شود و
                        با استفاده از ریداکس محتوای تکس باکس نمایش داده می شود
                    </h3>
                    <br /><br />

                    <h3>4 - نمایش محصولات به صورت code splitting</h3>
                    <br /><br />


                    <h3>5 - ایجاد یک کلیک سفارشی و استفاده از آن در روت های محصولات و کاربران</h3>
                    <br /><br />


                    <h3>6 - استفاده از حالت pwa</h3>
                    <br /><br />
                </p>
            </div>
        </div>
    )
}